Revit 2025 API
ExternalDataInstanceAddedIntoDocumentEventArgs.ItemId Property
 The id of the external data item to which a new reference has been added.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string ItemId { get; }
Public ReadOnly Property ItemId As String
	Get
public:
property String^ ItemId {
	String^ get ();
}
member ItemId : string with get
Property Value
String
See Also
Reference
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace